---
kind: property
id: P:Autodesk.Revit.DB.Analysis.HVACLoadType.PlenumLighting
source: html/325c0e6e-6fcb-5d48-179e-09c733e9e6a0.htm
---
# Autodesk.Revit.DB.Analysis.HVACLoadType.PlenumLighting Property

The percentage of plenum lighting contribution.

## Syntax (C#)
```csharp
public double PlenumLighting { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The value should be between [0.0,1.0].